src/test/resources/Invoices.xml

<Invoices>
  <Invoice>
    <Type>ACCREC</Type>
    <Contact>
      <ContactNumber>0006841301</ContactNumber>
      <Name>Ariki Properties</Name>
      <ContactStatus>ACTIVE</ContactStatus>
      <EmailAddress>emailaddress@yourdomain.com</EmailAddress>
      <SkypeUserName>Skype Name/Number</SkypeUserName>
      <BankAccountDetails>Bank Account Details</BankAccountDetails>
      <TaxNumber>Tax ID Number</TaxNumber>
      <AccountsReceivableTaxType>OUTPUT</AccountsReceivableTaxType>
      <AccountsPayableTaxType>INPUT</AccountsPayableTaxType>
      <FirstName>Simon</FirstName>
      <LastName>Greenville</LastName>
      <DefaultCurrency>USD</DefaultCurrency>
      <Addresses>
        <Address>
          <AddressType>POBOX</AddressType>
          <AttentionTo>Simon G.</AttentionTo>
          <AddressLine1>PO Box 10112</AddressLine1>
          <AddressLine2></AddressLine2>
          <AddressLine3></AddressLine3>
          <AddressLine4></AddressLine4>
          <City>New York</City>
          <Region>New York State</Region>
          <PostalCode>10112</PostalCode>
          <Country>USA</Country>
        </Address>
        <Address>
          <AddressType>STREET</AddressType>
          <AttentionTo>Simon G.</AttentionTo>
          <AddressLine1>Level 71</AddressLine1>
          <AddressLine2>30 Rockefeller plaza</AddressLine2>
          <AddressLine3></AddressLine3>
          <AddressLine4></AddressLine4>
          <City>New York</City>
          <Region>New York State</Region>
          <PostalCode>10112</PostalCode>
          <Country>USA</Country>
        </Address>
      </Addresses>
      <Phones>
        <Phone>
          <PhoneType>DEFAULT</PhoneType>
          <PhoneNumber>5996999</PhoneNumber>
          <PhoneAreaCode>877</PhoneAreaCode>
          <PhoneCountryCode>0001</PhoneCountryCode>
        </Phone>
        <Phone>
          <PhoneType>DDI</PhoneType>
          <PhoneNumber>1234567</PhoneNumber>
          <PhoneAreaCode>877</PhoneAreaCode>
          <PhoneCountryCode>0001</PhoneCountryCode>
        </Phone>
        <Phone>
          <PhoneType>FAX</PhoneType>
          <PhoneNumber>7654321</PhoneNumber>
          <PhoneAreaCode>877</PhoneAreaCode>
          <PhoneCountryCode>0001</PhoneCountryCode>
        </Phone>
        <Phone>
          <PhoneType>MOBILE</PhoneType>
          <PhoneNumber>5555555</PhoneNumber>
          <PhoneAreaCode>877</PhoneAreaCode>
          <PhoneCountryCode>0001</PhoneCountryCode>
        </Phone>
      </Phones>
    </Contact>
    <Date>2009-09-08T00:00:00</Date>
    <DueDate>2009-10-20T00:00:00</DueDate>
    <InvoiceNumber>OIT:01065</InvoiceNumber>
    <Reference>Ref:SMITHK</Reference>
    <BrandingThemeID>3b148ee0-adfa-442c-a98b-9059a73e8ef5</BrandingThemeID>
    <Url>http://www.accounting20.com</Url>
    <CurrencyCode>NZD</CurrencyCode>
    <Status>SUBMITTED</Status>
    <LineAmountTypes>Inclusive</LineAmountTypes>
    <SubTotal>87.11</SubTotal>
    <TotalTax>10.89</TotalTax>
    <Total>98.00</Total>
    <LineItems>
      <LineItem>
        <Description>3 copies of OS X 10.6 Snow Leopard</Description>
        <Quantity>3.0000</Quantity>
        <UnitAmount>59.00</UnitAmount>
        <TaxType>OUTPUT</TaxType>
        <TaxAmount>19.67</TaxAmount>
        <LineAmount>177.00</LineAmount>
        <AccountCode>200</AccountCode>
        <Tracking>
          <TrackingCategory>
            <TrackingCategoryID>e2f2f732-e92a-4f3a-9c4d-ee4da0182a13</TrackingCategoryID>
            <Name>Region</Name>
            <Option>North</Option>
          </TrackingCategory>
        </Tracking>
      </LineItem>
      <LineItem>
        <Description>Returned Apple Keyboard with Numeric Keypad (faulty)</Description>
        <Quantity>1.0000</Quantity>
        <UnitAmount>-79.00</UnitAmount>
        <TaxType>OUTPUT</TaxType>
        <TaxAmount>-8.78</TaxAmount>
        <LineAmount>-79.00</LineAmount>
        <AccountCode>200</AccountCode>
        <Tracking />
      </LineItem>
    </LineItems>
  </Invoice>
</Invoices>